---
title: AdvancedMetal
classe: Autodesk.Revit.DB.Visual.AdvancedMetal
namespace: Autodesk.Revit.DB.Visual
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 8
---

# AdvancedMetal

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String MetalF0 { get; }` | `AdvancedMetal.MetalF0` | String |
| `String SurfaceAlbedo { get; }` | `AdvancedMetal.SurfaceAlbedo` | String |
| `String SurfaceAnisotropy { get; }` | `AdvancedMetal.SurfaceAnisotropy` | String |
| `String SurfaceCutout { get; }` | `AdvancedMetal.SurfaceCutout` | String |
| `String SurfaceNdfType { get; }` | `AdvancedMetal.SurfaceNdfType` | String |
| `String SurfaceNormal { get; }` | `AdvancedMetal.SurfaceNormal` | String |
| `String SurfaceRotation { get; }` | `AdvancedMetal.SurfaceRotation` | String |
| `String SurfaceRoughness { get; }` | `AdvancedMetal.SurfaceRoughness` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```